In [23]:
import pandas
import os
import sys
from pathlib import Path


CRM_CSV = Path('../../../data_src/CRM.csv')  
ERP_CSV = Path('../../../data_src/ERP.csv')
Ecommerce_CSV = Path('../../../data_src/Ecommerce.csv')

crm_df = pandas.read_csv(CRM_CSV)
erp_df = pandas.read_csv(ERP_CSV)
ecommerce_df = pandas.read_csv(Ecommerce_CSV)

dfs   = [crm_df, erp_df, ecommerce_df]

print("Displaying the first 5 rows of each DataFrame:\n")
for df in dfs:
    display(df.head())

Displaying the first 5 rows of each DataFrame:

   client_id       nom              email date_inscription revenu_annuel
0          1  Client_1  client1@gmail.com       06/03/2022           NaN
1          2  Client_2  client2@gmail.com       15/03/2022         35000
2          3  Client_3  client3@gmail.com       08/01/2023         35000
3          4  Client_4  client4@gmail.com       28/04/2022        28000€
4          5  Client_5  client5@gmail.com       25/09/2022      42 000 €

   id_client nom_client      ville  chiffre_affaires date_creation
0         17   Client_4      Paris           9547.21    2023-10-13
1         15   Client_3  Marseille           3022.80    2021-10-24
2          5  Client_11      Paris           2484.10    2022-03-20
3          6  Client_18      Paris           7221.65    2022-06-26
4         11  Client_14  Marseille           6062.34    2023-09-22

   customerID  full_name purchase_date total_spent newsletter_optin
0          13  Client_11    08-10-2023     436.86€              Yes
1          10   Client_8    24-02-2023     238.32€              NaN
2          18  Client_18    12-01-2023      92.62€              NaN
3          21   Client_9    07-01-2023     394.42€               No
4           9  Client_17    22-03-2023     184.17€              Yes

In [35]:
# detect data quality issues
print("Data Quality Issues:\n")
for i, df in enumerate(dfs, start=1):
    missing_values = df.isnull().sum().sum()
    duplicate_rows = df.duplicated().sum()
    print(f"DataFrame {i}: Missing Values = {missing_values}, Duplicate Rows = {duplicate_rows}")

Data Quality Issues:

DataFrame 1: Missing Values = 4, Duplicate Rows = 15
DataFrame 2: Missing Values = 2, Duplicate Rows = 0
DataFrame 3: Missing Values = 6, Duplicate Rows = 0

   client_name  client_id  chiffre_affaires client_signup_date  \
0     Client_1          1           1620.85         2022-03-06
1    Client_10         10           8242.09         2023-04-21
2    Client_11         11           6062.34         2023-08-17
3    Client_12         12               NaN         2022-05-20
4    Client_13         13               NaN         2023-03-16
5    Client_14         14               NaN         2023-02-02
6    Client_15         15           3022.80         2023-11-08
7     Client_2          2               NaN         2022-03-15
8    Client_20         19           5426.38                NaT
9     Client_3          3           9509.23         2023-01-08
10    Client_4          4           2166.76         2022-04-28
11    Client_5          5           2484.10         2022-09-25
12    Client_6          6           7221.65         2023-03-26
13    Client_7          7           5926.00         2022-10-29
14    Client_8          8           2333.85         2022-08-22
15    Client_9          9               NaN         2022-08-30

                 email revenu_annuel      ville  revenu_annuel_num
0    client1@gmail.com           NaN   Toulouse                NaN
1   client10@gmail.com        28000€   Toulouse            28000.0
2   client11@gmail.com      42 000 €  Marseille            42000.0
3   client12@gmail.com         35000        NaN            35000.0
4   client13@gmail.com           NaN        NaN                NaN
5   client14@gmail.com         35000        NaN            35000.0
6   client15@gmail.com         52000  Marseille            52000.0
7    client2@gmail.com         35000        NaN            35000.0
8                  NaN           NaN        NaN                NaN
9    client3@gmail.com         35000        NaN            35000.0
10   client4@gmail.com        28000€      Paris            28000.0
11   client5@gmail.com      42 000 €      Paris            42000.0
12   client6@gmail.com         52000      Paris            52000.0
13   client7@gmail.com         52000   Toulouse            52000.0
14   client8@gmail.com         52000   Toulouse            52000.0
15   client9@gmail.com        28000€        NaN            28000.0

In [ ]:
import pymysql
connection = pymysql.connect(
    host='localhost',
    user='user',
    password='password',
    database='mydatabase'
)
cursor = connection.cursor()
all_data = cursor.execute("SELECT * FROM unified")
all_data = cursor.fetchall()

data_df = pandas.DataFrame(all_data, columns=[desc[0] for desc in cursor.description])
display(data_df.head())

,client_id,nom,email,date_inscription,revenu_annuel,customerID,full_name,purchase_date,total_spent,newsletter_optin,id_client,nom_client,ville,chiffre_affaires,date_creation
0,15,Client_15,client15@gmail.com,08/11/2023,52000,NaN,None,None,None,None,15.0,Client_3,Marseille,3022.80,2021-10-24
1,15,Client_15,client15@gmail.com,08/11/2023,52000,NaN,None,None,None,None,15.0,Client_3,Marseille,3022.80,2021-10-24
2,5,Client_5,client5@gmail.com,25/09/2022,42 000 €,5.0,Client_19,20-12-2023,64.91€,,5.0,Client_11,Paris,2484.10,2022-03-20
3,5,Client_5,client5@gmail.com,25/09/2022,42 000 €,5.0,Client_19,20-12-2023,64.91€,,5.0,Client_11,Paris,2484.10,2022-03-20
4,6,Client_6,client6@gmail.com,26/03/2023,52000,6.0,Client_21,11-12-2023,287.13€,Yes,6.0,Client_18,Paris,7221.65,2022-06-26

In [66]:
# remove duplicates
data_df = data_df.drop_duplicates()
display(data_df.head())

,client_id,nom,email,date_inscription,revenu_annuel,customerID,full_name,purchase_date,total_spent,newsletter_optin,id_client,nom_client,ville,chiffre_affaires,date_creation
0,15,Client_15,client15@gmail.com,08/11/2023,52000,NaN,None,None,None,None,15.0,Client_3,Marseille,3022.80,2021-10-24
2,5,Client_5,client5@gmail.com,25/09/2022,42 000 €,5.0,Client_19,20-12-2023,64.91€,,5.0,Client_11,Paris,2484.10,2022-03-20
4,6,Client_6,client6@gmail.com,26/03/2023,52000,6.0,Client_21,11-12-2023,287.13€,Yes,6.0,Client_18,Paris,7221.65,2022-06-26
6,11,Client_11,client11@gmail.com,17/08/2023,42 000 €,NaN,None,None,None,None,11.0,Client_14,Marseille,6062.34,2023-09-22
8,3,Client_3,client3@gmail.com,08/01/2023,35000,NaN,None,None,None,None,3.0,Client_12,,9509.23,2022-11-30

In [82]:
# new df
import uuid

def get_name(row):
    if getattr(row, 'nom', None) not in [None, '']:
        return row.nom
    elif getattr(row, 'full_name', None) not in [None, '']:
        return row.full_name
    elif getattr(row, 'nom_client', None) not in [None, '']:
        return row.nom_client
    else:
        return 'Unknown'

records = []
for row in data_df.itertuples():
    name = get_name(row)

    # getattr pour gérer les colonnes manquantes sinon erreur
    email = getattr(row, 'email', None)
    signup_date = getattr(row, 'date_inscription', None)
    annual_income = getattr(row, 'revenu_annuel', None) or None

    # gestion des deux colonnes possibles pour le montant d'achat
    purchase_amount = getattr(row, 'purchase_amount', None)
    if purchase_amount in (None, ''):
        purchase_amount = getattr(row, 'total_spent', None) or 0

    total_spent = getattr(row, 'total_spent', None) or 0
    newsletter_optin = getattr(row, 'newsletter_optin', None) or False
    city = getattr(row, 'ville', None) or 'Unknown'

    records.append({
        'id': str(uuid.uuid4()),
        'name': name,
        'email': email,
        'signup_date': signup_date,
        'annual_income': annual_income,
        'purchase_amount': purchase_amount,
        'total_spent': total_spent,
        'newsletter_optin': newsletter_optin,
        'city': city
    })

new_df = pandas.DataFrame.from_records(records).sort_values(by='name')
display(new_df)

# sauvegarde sql
from sqlalchemy import create_engine # noqa

# crée un moteur SQLAlchemy pour MySQL
engine = create_engine("mysql+pymysql://user:password@localhost/mydatabase")
new_df.to_sql('final_customers', con=engine, if_exists='replace', index=False)

,id,name,email,signup_date,annual_income,purchase_amount,total_spent,newsletter_optin,city
9,4517237b-065a-4db5-bb62-87ea18f1675b,Client_1,client1@gmail.com,06/03/2022,None,0,0,False,Toulouse
6,db877896-bcfc-4712-be8b-8e2898633029,Client_10,client10@gmail.com,21/04/2023,28000€,238.32€,238.32€,False,Toulouse
3,2fa1e869-9ea7-43bb-a897-647383561a43,Client_11,client11@gmail.com,17/08/2023,42 000 €,0,0,False,Marseille
12,5cf89277-147f-4f7e-b027-0b6917880c9a,Client_12,client12@gmail.com,20/05/2022,35000,169.02€,169.02€,False,Unknown
10,2e7f69d6-89b0-41ca-81df-38a8d39c5388,Client_13,client13@gmail.com,16/03/2023,None,436.86€,436.86€,Yes,Unknown
13,b519b443-3db9-4d6c-a563-0875def7378f,Client_14,client14@gmail.com,02/02/2023,35000,497.69€,497.69€,False,Unknown
0,135668f1-d091-4102-80cf-afe8570728c4,Client_15,client15@gmail.com,08/11/2023,52000,0,0,False,Marseille
14,5e05805d-a868-44cd-a210-1888fc6fd081,Client_2,client2@gmail.com,15/03/2022,35000,0,0,False,Unknown
4,a3a5017a-4176-4036-b46c-c27dd9089c41,Client_3,client3@gmail.com,08/01/2023,35000,0,0,False,Unknown
7,e0a36427-c8ce-4911-bfbc-aa4fcd509636,Client_4,client4@gmail.com,28/04/2022,28000€,0,0,False,Paris
1,7b407087-718c-48e7-bf29-2bcd1574dd41,Client_5,client5@gmail.com,25/09/2022,42 000 €,64.91€,64.91€,False,Paris
2,cc29e640-1a59-40eb-bfb6-adb1c1fc679a,Client_6,client6@gmail.com,26/03/2023,52000,287.13€,287.13€,Yes,Paris
8,cddaf0a4-cc60-4b84-924f-fedaf53f71e2,Client_7,client7@gmail.com,29/10/2022,52000,265.94€,265.94€,No,Toulouse
5,7fe0605d-3eda-4ea9-8b2e-dceea98e88e7,Client_8,client8@gmail.com,22/08/2022,52000,176.28€,176.28€,No,Toulouse
11,6c07f0a3-b913-4c11-9459-7f9b38bc5338,Client_9,client9@gmail.com,30/08/2022,28000€,184.17€,184.17€,Yes,Unknown

15

ERROR! Session/line number was not unique in database. History logging moved to new session 39

/tmp/ipykernel_823498/334951042.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  new_df.to_sql('final_customers', con=connection, if_exists='replace', index=False)

DatabaseError: Execution failed on sql '
        SELECT
            name
        FROM
            sqlite_master
        WHERE
            type IN ('table', 'view')
            AND name=?;
        ': not all arguments converted during string formatting